apache/nuttx/arch/mips/src/pic32mz/hardware/pic32mz_ethernet.h
/****************************************************************************************************
 * arch/mips/src/pic32mz/hardware/pic32mz_ethernet.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************************************/

#ifndef __ARCH_MIPS_SRC_PIC32MZ_HARDWARE_PIC32MZ_ETHERNET_H
#define __ARCH_MIPS_SRC_PIC32MZ_HARDWARE_PIC32MZ_ETHERNET_H

/****************************************************************************************************
 * Included Files
 ****************************************************************************************************/

#include <nuttx/config.h>
#include <arch/pic32mz/chip.h>

#include "hardware/pic32mz_memorymap.h"

#if CHIP_NETHERNET > 0

/****************************************************************************************************
 * Pre-processor Definitions
 ****************************************************************************************************/
/* Register Offsets *********************************************************************************/

/* Controller and DMA Engine Configuration/Status Registers */

#define PIC32MZ_ETH_CON1_OFFSET        0x0000  /* Ethernet Controller Control 1 Register */
#define PIC32MZ_ETH_CON1CLR_OFFSET     0x0004
#define PIC32MZ_ETH_CON1SET_OFFSET     0x0008
#define PIC32MZ_ETH_CON1INV_OFFSET     0x000c

#define PIC32MZ_ETH_CON2_OFFSET        0x0010  /* Ethernet Controller Control 2 Register */
#define PIC32MZ_ETH_CON2CLR_OFFSET     0x0014
#define PIC32MZ_ETH_CON2SET_OFFSET     0x0018
#define PIC32MZ_ETH_CON2INV_OFFSET     0x001c

#define PIC32MZ_ETH_TXST_OFFSET        0x0020  /* Ethernet Controller TX Packet Descriptor Start Address Register */
#define PIC32MZ_ETH_TXSTCLR_OFFSET     0x0024
#define PIC32MZ_ETH_TXSTSET_OFFSET     0x0028
#define PIC32MZ_ETH_TXSTINV_OFFSET     0x002c

#define PIC32MZ_ETH_RXST_OFFSET        0x0030  /* Ethernet Controller RX Packet Descriptor Start Address Register */
#define PIC32MZ_ETH_RXSTCLR_OFFSET     0x0034
#define PIC32MZ_ETH_RXSTSET_OFFSET     0x0038
#define PIC32MZ_ETH_RXSTINV_OFFSET     0x003c

#define PIC32MZ_ETH_IEN_OFFSET         0x00c0  /* Ethernet Controller Interrupt Enable Register */
#define PIC32MZ_ETH_IENCLR_OFFSET      0x00c4
#define PIC32MZ_ETH_IENSET_OFFSET      0x00c8
#define PIC32MZ_ETH_IENINV_OFFSET      0x00cc

#define PIC32MZ_ETH_IRQ_OFFSET         0x00d0  /* Ethernet Controller Interrupt Request Register */
#define PIC32MZ_ETH_IRQCLR_OFFSET      0x00d4
#define PIC32MZ_ETH_IRQSET_OFFSET      0x00d8
#define PIC32MZ_ETH_IRQINV_OFFSET      0x00dc

#define PIC32MZ_ETH_STAT_OFFSET        0x00e0  /* Ethernet Controller Status Register */

/* RX Filtering Configuration Registers */

#define PIC32MZ_ETH_RXFC_OFFSET        0x00a0  /* Ethernet Controller Receive Filter Configuration Register */
#define PIC32MZ_ETH_RXFCCLR_OFFSET     0x00a4
#define PIC32MZ_ETH_RXFCSET_OFFSET     0x00a8
#define PIC32MZ_ETH_RXFCINV_OFFSET     0x00ac

#define PIC32MZ_ETH_HT0_OFFSET         0x0040  /* Ethernet Controller Hash Table 0 Register */
#define PIC32MZ_ETH_HT0CLR_OFFSET      0x0044
#define PIC32MZ_ETH_HT0SET_OFFSET      0x0048
#define PIC32MZ_ETH_HT0INV_OFFSET      0x004c

#define PIC32MZ_ETH_HT1_OFFSET         0x0050  /* Ethernet Controller Hash Table 1 Register */
#define PIC32MZ_ETH_HT1CLR_OFFSET      0x0054
#define PIC32MZ_ETH_HT1SET_OFFSET      0x0058
#define PIC32MZ_ETH_HT1INV_OFFSET      0x005c

#define PIC32MZ_ETH_PMM0_OFFSET        0x0060  /* Ethernet Controller Pattern Match Mask 0 Register */
#define PIC32MZ_ETH_PMM0CLR_OFFSET     0x0064
#define PIC32MZ_ETH_PMM0SET_OFFSET     0x0068
#define PIC32MZ_ETH_PMM0INV_OFFSET     0x006c

#define PIC32MZ_ETH_PMM1_OFFSET        0x0070  /* Ethernet Controller Pattern Match Mask 1 Register */
#define PIC32MZ_ETH_PMM1CLR_OFFSET     0x0074
#define PIC32MZ_ETH_PMM1SET_OFFSET     0x0078
#define PIC32MZ_ETH_PMM1INV_OFFSET     0x007c

#define PIC32MZ_ETH_PMCS_OFFSET        0x0080  /* Ethernet Controller Pattern Match Checksum Register */
#define PIC32MZ_ETH_PMCSCLR_OFFSET     0x0084
#define PIC32MZ_ETH_PMCSSET_OFFSET     0x0088
#define PIC32MZ_ETH_PMCSINV_OFFSET     0x008c

#define PIC32MZ_ETH_PMO_OFFSET         0x0090  /* Ethernet Controller Pattern Match Offset Register */
#define PIC32MZ_ETH_PMOCLR_OFFSET      0x0094
#define PIC32MZ_ETH_PMOSET_OFFSET      0x0098
#define PIC32MZ_ETH_PMOINV_OFFSET      0x009c

/* Flow Control Configuring Register */

#define PIC32MZ_ETH_RXWM_OFFSET        0x00b0  /* Ethernet Controller Receive Watermarks Register */
#define PIC32MZ_ETH_RXWMCLR_OFFSET     0x00b4
#define PIC32MZ_ETH_RXWMSET_OFFSET     0x00b8
#define PIC32MZ_ETH_RXWMINV_OFFSET     0x00bc

/* Ethernet Statistics Registers */

#define PIC32MZ_ETH_RXOVFLOW_OFFSET    0x0100  /* Ethernet Controller Receive Overflow Statistics Register */
#define PIC32MZ_ETH_RXOVFLOWCLR_OFFSET 0x0104
#define PIC32MZ_ETH_RXOVFLOWSET_OFFSET 0x0108
#define PIC32MZ_ETH_RXOVFLOWINV_OFFSET 0x010c

#define PIC32MZ_ETH_FRMTXOK_OFFSET     0x0110  /* Ethernet Controller Frames Transmitted OK Statistics Register */
#define PIC32MZ_ETH_FRMTXOKCLR_OFFSET  0x0114
#define PIC32MZ_ETH_FRMTXOKSET_OFFSET  0x0118
#define PIC32MZ_ETH_FRMTXOKINV_OFFSET  0x011c

#define PIC32MZ_ETH_SCOLFRM_OFFSET     0x0120  /* Ethernet Controller Single Collision Frames Statistics Register */
#define PIC32MZ_ETH_SCOLFRMCLR_OFFSET  0x0124
#define PIC32MZ_ETH_SCOLFRMSET_OFFSET  0x0128
#define PIC32MZ_ETH_SCOLFRMINV_OFFSET  0x012c

#define PIC32MZ_ETH_MCOLFRM_OFFSET     0x0130  /* Ethernet Controller Multiple Collision Frames Statistics Register */
#define PIC32MZ_ETH_MCOLFRMCLR_OFFSET  0x0134
#define PIC32MZ_ETH_MCOLFRMSET_OFFSET  0x0138
#define PIC32MZ_ETH_MCOLFRMINV_OFFSET  0x013c

#define PIC32MZ_ETH_FRMRXOK_OFFSET     0x0140  /* Ethernet Controller Frames Received OK Statistics Register */
#define PIC32MZ_ETH_FRMRXOKCLR_OFFSET  0x0144
#define PIC32MZ_ETH_FRMRXOKSET_OFFSET  0x0148
#define PIC32MZ_ETH_FRMRXOKINV_OFFSET  0x014c

